/*
Navicat MySQL Data Transfer

Source Server         : 本地MySQL数据库
Source Server Version : 50539
Source Host           : 127.0.0.1:3306
Source Database       : phonedata

Target Server Type    : MYSQL
Target Server Version : 50539
File Encoding         : 65001

Date: 2019-11-18 16:49:04
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for phone
-- ----------------------------
DROP TABLE IF EXISTS `phone`;
CREATE TABLE `phone` (
  `id` int(10) NOT NULL,
  `name` varchar(25) NOT NULL,
  `model` varchar(25) NOT NULL,
  `color` varchar(10) NOT NULL,
  `price` float(10,2) NOT NULL,
  `memory` varchar(25) NOT NULL,
  `info` varchar(255) NOT NULL,
  `stock` int(10) NOT NULL,
  `print` varchar(25) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `color` (`color`,`id`,`memory`),
  KEY `id` (`id`,`color`,`memory`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of phone
-- ----------------------------
INSERT INTO `phone` VALUES ('1', 'P30Pro', 'hw', '红', '3688.00', '8G+512G', '商品毛重：500.00g存储卡：其它存储卡摄像头数量：后置三摄前摄主摄像素：3200万像素操作系统：Android(安卓)屏幕比例：其它屏幕比例CPU型号：麒麟980后摄主摄像素：4000万像素电池容量：4000mAh-4249mAh机身存储：其它存储屏幕前摄组合：其他', '91', '1.jpg');
INSERT INTO `phone` VALUES ('2', '8e', 'hw', '白', '549.00', '2GB+32GB', '商品毛重：310.00g商品产地：中国大陆充电功率：小于12 W存储卡：支持MicroSD(TF)CPU型号：其他摄像头数量：后置单摄前摄主摄像素：500万像素电池容量：3000mAh-3499mAh屏幕比例：18:9机身颜色：金色热点：人脸识别运行内存：2GB特殊功能：语音命令，语音识别(文字语音互转)后摄主摄像素：1300万像素操作系统：Android(安卓)机身存储：32GB屏幕前摄组合：其他', '97', '2.jpg');
INSERT INTO `phone` VALUES ('3', 'mate30', 'hw', '黑', '3999.00', '6+128G', '品毛重：500.00g存储卡：NM存储卡拍照特点：景深，后置三摄摄像头数量：后置三摄前摄主摄像素：2400万像素操作系统：Android(安卓)屏幕比例：19.5:9机身颜色：黑色热点：人脸识别，NFC，无线充电运行内存：6GBCPU型号：麒麟990后摄主摄像素：4000万像素屏幕前摄组合：刘海屏电池容量：4000mAh-4249mAh机身存储：256GB', '97', '3.jpg');
INSERT INTO `phone` VALUES ('4', 'nova5 Pro', 'hw', '黑', '2699.00', '8G+128G', '商品毛重：495.00g存储卡：NM存储卡摄像头数量：后置四摄前摄主摄像素：3200万像素操作系统：Android(安卓)屏幕比例：其它屏幕比例机身颜色：黑色运行内存：8GBCPU型号：麒麟980后摄主摄像素：4800万像素屏幕前摄组合：其他电池容量：3500mAh-3749mAh机身存储：128GB', '100', '4.jpg');
INSERT INTO `phone` VALUES ('5', '9Pro', 'mi', '白', '4199.00', '12GB+512GB', '商品毛重：480.00g存储卡：其它存储卡摄像头数量：后置三摄前摄主摄像素：2000万像素操作系统：Android(安卓)屏幕比例：其它屏幕比例机身颜色：混合色运行内存：其它内存后摄主摄像素：4800万像素屏幕前摄组合：其他CPU型号：骁龙855plus机身存储：其它存储', '99', '5.jpg');
INSERT INTO `phone` VALUES ('6', 'CC9', 'mi', '白', '1799.00', '6GB+64GB', '商品毛重：490.00g商品产地：中国大陆存储卡：支持MicroSD(TF)摄像头数量：后置三摄前摄主摄像素：3200万像素CPU型号：骁龙710屏幕比例：19.5:9机身颜色：白色热点：人脸识别，NFC运行内存：6GB机身存储：64GB后摄主摄像素：4800万像素屏幕前摄组合：水滴屏操作系统：Android(安卓)电池容量：4000mAh-4249mAh', '100', '6.jpg');
INSERT INTO `phone` VALUES ('7', 'Max3', 'mi', '黑', '1299.00', '6GB+128GB', '商品毛重：500.00g商品产地：中国大陆存储卡：支持MicroSD(TF)摄像头数量：后置双摄前摄主摄像素：800万像素电池容量：5000mAh以上屏幕比例：18:94G LTE网络特性：VOLTE 4G通话CPU型号：其他运行内存：6GB操作系统：Android(安卓)机身存储：128GB机身颜色：黑色屏幕前摄组合：其他后摄主摄像素：1200万像素', '94', '7.jpg');
INSERT INTO `phone` VALUES ('8', 'MIX2S', 'mi', '白', '1799.00', '6GB+128GB', '商品毛重：0.58kg商品产地：中国大陆存储卡：不支持存储卡摄像头数量：后置双摄前摄主摄像素：500万像素CPU型号：骁龙845屏幕比例：18:9机身颜色：白色热点：人脸识别，快速充电，无线充电运行内存：6GB机身存储：128GB后摄主摄像素：1200万像素屏幕前摄组合：其他操作系统：Android(安卓)电池容量：3000mAh-3499mAh', '98', '8.jpg');
INSERT INTO `phone` VALUES ('9', ' iQOO Pro', 'vivo', '蓝', '4098.00', '12GB+128GB', '商品毛重：500.00g存储卡：不支持存储卡摄像头数量：后置三摄前摄主摄像素：1200万像素操作系统：Android(安卓)屏幕比例：19.5:9机身颜色：蓝色运行内存：12GBCPU型号：骁龙855plus后摄主摄像素：4800万像素屏幕前摄组合：其他电池容量：4500mAh-5000mAh机身存储：其它存储', '98', '9.jpg');
INSERT INTO `phone` VALUES ('10', ' U3x', 'vivo', '黑', '799.00', '3GB+32GB', '商品毛重：500.00g充电功率：18-19W存储卡：不支持存储卡拍照特点：后置三摄摄像头数量：后置三摄屏占比：<90%电池容量：5000mAh以上屏幕比例：其它屏幕比例机身颜色：黑色前摄主摄像素：800万像素运行内存：3GB屏幕前摄组合：水滴屏后摄主摄像素：1300万像素CPU型号：骁龙665机身存储：其它存储操作系统：Android(安卓)', '100', '10.jpg');
INSERT INTO `phone` VALUES ('11', 'S1Pro', 'vivo', '红', '2198.00', '8GB+128GB', '商品毛重：0.525kg存储卡：不支持存储卡拍照特点：景深，后置三摄摄像头数量：后置三摄前摄主摄像素：3200万像素CPU型号：骁龙675屏幕比例：19.5:9机身颜色：红色热点：快速充电，屏幕指纹，超高屏占比，弹出式摄像头运行内存：8GB机身存储：其它存储后摄主摄像素：4800万像素屏幕前摄组合：弹出式摄像头操作系统：Android(安卓)电池容量：3500mAh-3749mAh', '100', '11.jpg');
INSERT INTO `phone` VALUES ('12', '16s Pro', 'mei', '黑', '2999.00', '8GB+128GB', '商品毛重：445.00g商品产地：中国大陆存储卡：不支持存储卡拍照特点：后置三摄，光学防抖前摄主摄像素：2000万像素游戏性能：其他4G LTE网络特性：VOLTE 4G通话运行内存：8GB后摄主摄像素：4800万像素游戏配置：游戏性能模式摄像头数量：后置三摄操作系统：Android(安卓)屏幕比例：其它屏幕比例机身颜色：黑色热点：屏幕指纹，NFC屏占比：≥91%特殊功能：超大字体机身存储：128GBCPU型号：骁龙855plus电池容量：3500mAh-3749mAh充电功率：20-26W', '100', '12.jpg');
INSERT INTO `phone` VALUES ('13', '16th', 'mei', '黑', '1648.00', '6GB+64GB', '商品毛重：460.00g商品产地：中国大陆存储卡：不支持存储卡拍照特点：后置双摄前摄主摄像素：2000万像素游戏性能：发烧级4G LTE网络特性：其他运行内存：6GB后摄主摄像素：1200万像素游戏配置：游戏性能模式摄像头数量：后置双摄操作系统：Android(安卓)屏幕比例：18:9机身颜色：黑色热点：屏幕指纹屏占比：≥91%特殊功能：超大字体机身存储：64GBCPU型号：骁龙845电池容量：3000mAh-3499mAh充电功率：18-19W', '100', '13.jpg');
INSERT INTO `phone` VALUES ('14', 'V8', 'mei', '黑', '685.00', '4+64G', '商品毛重：500.00g存储卡：其它存储卡摄像头数量：后置双摄前摄主摄像素：其他操作系统：Android(安卓)屏幕比例：其它屏幕比例CPU型号：其他后摄主摄像素：其他电池容量：3000mAh-3499mAh机身存储：其它存储屏幕前摄组合：其他', '98', '14.jpg');
INSERT INTO `phone` VALUES ('15', 'Galaxy A90', '三星', '黑', '4499.00', '8GB+128GB', '商品毛重：206.00g商品产地：越南存储卡：不支持存储卡摄像头数量：后置三摄前摄主摄像素：3200万像素操作系统：Android(安卓)屏幕比例：20:9机身颜色：黑色运行内存：8GB后摄主摄像素：4800万像素屏幕前摄组合：其他CPU型号：骁龙855机身存储：128GB', '111', '15.jpg');
INSERT INTO `phone` VALUES ('16', 'Note10+', '三星', '白', '7999.00', '12GB+256GB', '商品毛重：0.52kg商品产地：越南存储卡：支持MicroSD(TF)摄像头数量：后置四摄前摄主摄像素：1000万像素CPU型号：骁龙855屏幕比例：19:9机身颜色：黑色热点：5G运行内存：12GB机身存储：256GB后摄主摄像素：1600万像素屏幕前摄组合：其他操作系统：Android(安卓)电池容量：4250mAh-4449mAh', '111', '16.jpg');
INSERT INTO `phone` VALUES ('17', 'Reno2', 'oppo', '蓝', '2999.00', '8G+128G', '商品毛重：500.00g存储卡：支持MicroSD(TF)拍照特点：后置四摄，景深，微距屏占比：≥93%运行内存：8GB后摄主摄像素：4800万像素游戏配置：游戏勿扰模式，游戏性能模式摄像头数量：后置四摄电池容量：4000mAh-4249mAh屏幕比例：20:9充电功率：20-26W热点：人脸识别，NFC，屏幕指纹，超高屏占比，弹出式摄像头前摄主摄像素：1600万像素特殊功能：语音命令机身存储：128GBCPU型号：骁龙730G操作系统：Android(安卓)', '111', '17.jpg');
INSERT INTO `phone` VALUES ('18', 'iPhone 11 Pro', 'Apple', '灰', '10899.00', '256GB', '商品毛重：0.555kg商品产地：中国大陆存储卡：不支持存储卡摄像头数量：后置三摄前摄主摄像素：1200万像素操作系统：iOS(Apple)屏幕比例：其它屏幕比例机身颜色：绿色运行内存：其它内存后摄主摄像素：1200万像素屏幕前摄组合：其他CPU型号：其他机身存储：256GB', '111', '18.jpg');
INSERT INTO `phone` VALUES ('19', '荣耀8X Max', 'sam', '蓝', '1199.00', '6GB+64GB', '商品毛重：210.00g商品产地：中国大陆存储卡：支持MicroSD(TF)拍照特点：后置双摄摄像头数量：后置双摄前摄主摄像素：800万像素操作系统：Android(安卓)游戏性能：其他机身颜色：蓝色CPU型号：其他运行内存：6GB屏幕前摄组合：其他后摄主摄像素：1600万像素电池容量：4500mAh-5000mAh机身存储：64GB屏幕比例：其它屏幕比例', '111', '19.jpg');
INSERT INTO `phone` VALUES ('20', '红辣椒9X', '小辣椒', '蓝', '1099.00', '8+128GB', '商品毛重：320.00g商品产地：中国大陆存储卡：支持MicroSD(TF)摄像头数量：后置双摄前摄主摄像素：1300万像素电池容量：3000mAh-3499mAh屏幕比例：其它屏幕比例机身颜色：蓝色热点：人脸识别运行内存：8GBCPU型号：其他后摄主摄像素：1600万像素屏幕前摄组合：其他操作系统：Android(安卓)机身存储：128GB', '1', '20.jpg');
